# PANDAS_ASSIGNMENT_ADVANCE-1

## Q1. List any five functions of the pandas library with execution.
## Solution:

In [2]:
import pandas as pd

In [3]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 75000, 90000]}

In [4]:
dataf = pd.DataFrame(data)

In [5]:
dataf

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3    David   40   90000

## 1.head(): this function is used to print the first 5 rows of data by default.

In [6]:
dataf.head()

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3    David   40   90000

In [7]:
dataf.head(2)

    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000

## 2. describe(): this function generates discription of statistics operation.

In [8]:
dataf.describe()

             Age   Salary
count   4.000000      4.0
mean   32.500000  68750.0
std     6.454972  17500.0
min    25.000000  50000.0
25%    28.750000  57500.0
50%    32.500000  67500.0
75%    36.250000  78750.0
max    40.000000  90000.0

## 3. groupby() - Groups the DataFrame using a mapper or by a Series of columns.

In [11]:
gr = dataf.groupby('Age').mean()

/tmp/ipykernel_794/713154053.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  gr = dataf.groupby('Age').mean()

In [12]:
gr

      Salary
Age
25   50000.0
30   60000.0
35   75000.0
40   90000.0

## 4. sort_values: sort the dataframe by specified column.

In [13]:
sort = dataf.sort_values('Age')

In [14]:
sort

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3    David   40   90000

## 5. mean(): calculate the mean of each column.

In [15]:
dataf.mean()

/tmp/ipykernel_794/3878293785.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  dataf.mean()

Age          32.5
Salary    68750.0
dtype: float64

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.
## solution:

In [24]:
my_data = {'A':[1,2,3,4],'B':[5,6,7,8],'C':[9,10,11,12]}

In [25]:
my_data

{'A': [1, 2, 3, 4], 'B': [5, 6, 7, 8], 'C': [9, 10, 11, 12]}

In [26]:
new_f = pd.DataFrame(my_data)

In [27]:
new_f

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [30]:
new_f.reindex([1,2,3,0]).applymap(lambda x: x+2)

   A   B   C
1  4   8  12
2  5   9  13
3  6  10  14
0  3   7  11

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. Thefunction should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [33]:
data2 = pd.DataFrame({'Values':[10,20,30,40,50]})

In [34]:
data2

   Values
0      10
1      20
2      30
3      40
4      50

In [35]:
data2.head(3).sum()

Values    60
dtype: int64

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.
## solution:

In [39]:
df = pd.DataFrame({'Text':['Akshay','Data scientist','Google','Haryana']})

In [40]:
df

             Text
0          Akshay
1  Data scientist
2          Google
3         Haryana

In [42]:
df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))

In [43]:
df

             Text  Word_Count
0          Akshay           1
1  Data scientist           2
2          Google           1
3         Haryana           1

## Q5. How are DataFrame.size() and DataFrame.shape() different?
## solution:

## DataFrame.size(): it give the number of element present in the dataset or dataframe.
## DataFrame.shape(): it give the number of rows and columns present in the dataset or dataframe.

In [44]:
## example;

data4 = pd.DataFrame({'A':[1,2,3,4],'B':[5,6,7,8]})

In [45]:
data4

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [47]:
data4.size

8

In [49]:
data4.shape

(4, 2)

## Q6. Which function of pandas do we use to read an excel file?
## solution:

## we use pd.read_excel("file_name or link") function

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [71]:

def extract_username(df, email_column='Email', username_column='Username'):
    """
    Extracts the username part from the 'Email' column and creates a new 'Username' column in the DataFrame.

    Parameters:
    - df: DataFrame
        The input DataFrame.
    - email_column: str
        The name of the column containing email addresses.
    - username_column: str
        The name to be given to the new column containing usernames.

    Returns:
    - DataFrame
        The DataFrame with the new 'Username' column.
    """
    # Split the 'Email' column to extract usernames
    df[username_column] = df[email_column].str.split('@').str[0]
    
    return df

# Example usage:
# Create a sample DataFrame
data = {'Email': ['john.doe@example.com', 'jane.smith@example.com', 'bob.jones@example.com']}
df = pd.DataFrame(data)

# Apply the function to create the 'Username' column
df = extract_username(df)

# Display the result
print(df)

                    Email    Username
0    john.doe@example.com    john.doe
1  jane.smith@example.com  jane.smith
2   bob.jones@example.com   bob.jones

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [72]:
df4 = pd.DataFrame({'A':[3,8,6,2,9],'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

In [73]:
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [75]:
df4['A']>5

0    False
1     True
2     True
3    False
4     True
Name: A, dtype: bool

In [84]:
df4[(df4['A']>5) & (df4['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.
## solution:

In [85]:
df5 = pd.DataFrame({'Values':[23,45,67,89]})

In [86]:
df5

   Values
0      23
1      45
2      67
3      89

In [87]:
df5.mean()

Values    56.0
dtype: float64

In [88]:
df5.median()

Values    56.0
dtype: float64

In [89]:
df5.std()

Values    28.401878
dtype: float64

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.
## solution:

In [92]:
df6 = pd.DataFrame({'Sales':[234,670,1000,560,450,987,1000],'Date':["2023-10-10","2023-10-11","2023-10-12","2023-10-13","2023-10-14","2023-10-15","2023-10-16"]})

In [93]:
df6

   Sales        Date
0    234  2023-10-10
1    670  2023-10-11
2   1000  2023-10-12
3    560  2023-10-13
4    450  2023-10-14
5    987  2023-10-15
6   1000  2023-10-16

In [94]:
df6['MovingAverage'] = df6['Sales'].rolling(window=7).mean()

In [95]:
df6

   Sales        Date  MovingAverage
0    234  2023-10-10            NaN
1    670  2023-10-11            NaN
2   1000  2023-10-12            NaN
3    560  2023-10-13            NaN
4    450  2023-10-14            NaN
5    987  2023-10-15            NaN
6   1000  2023-10-16     700.142857

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
## solution:

In [96]:
df7 = pd.DataFrame({'Date':["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})

In [97]:
df7

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [99]:
df7.dtypes

Date    object
dtype: object

In [100]:
df7['Update_Date'] = pd.to_datetime(df7['Date'])

In [101]:
df7

         Date Update_Date
0  2023-01-01  2023-01-01
1  2023-01-02  2023-01-02
2  2023-01-03  2023-01-03
3  2023-01-04  2023-01-04
4  2023-01-05  2023-01-05

In [102]:
df7.dtypes

Date                   object
Update_Date    datetime64[ns]
dtype: object

In [112]:
df7['Weekday'] = df7['Update_Date'].dt.day_name()

In [113]:
df7

         Date Update_Date    Weekday
0  2023-01-01  2023-01-01     Sunday
1  2023-01-02  2023-01-02     Monday
2  2023-01-03  2023-01-03    Tuesday
3  2023-01-04  2023-01-04  Wednesday
4  2023-01-05  2023-01-05   Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.
## solution:

In [115]:
df8 = pd.date_range(start = '2023-01-01',end = '2023-01-31')

In [116]:
df8

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31'],
              dtype='datetime64[ns]', freq='D')

In [119]:
df_date = pd.DataFrame({'Date': df8})

In [120]:
df_date

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [124]:
df_date.dtypes

Date    datetime64[ns]
dtype: object

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?
## solution:

## import pandas as pd